openfoam_cases/[3]-80-pcnt-test-fin/system/controlDict
FoamFile
{
    version     11;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}

application     rhoPimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.1;           // adjust based on your simulation time scale

deltaT          1e-4;        // small timestep for stability in supersonic flow

writeControl    timeStep;

writeInterval   10000;        // write output every 1000 timesteps

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions  
{  
    
    
    sample  
    {  
        type probes;  
        libs ("libsampling.so");  
        interpolationScheme cellPointFace;
        setFormat raw;

        probeLocations
        (
            (0.58 0.0020000000949949026 0.17599999804632568)
            (0.58 0.0 0.17599999804632568)
            (0.599428571428571 0.0020000000949949026 0.17599999804632568)
            (0.599428571428571 0.0 0.17599999804632568)
            (0.618857142857143 0.0020000000949949026 0.17599999804632568)
            (0.618857142857143 0.0 0.17599999804632568)
            (0.638285714285714 0.0020000000949949026 0.17599999804632568)
            (0.638285714285714 0.0 0.17599999804632568)
            (0.657714285714286 0.0020000000949949026 0.17599999804632568)
            (0.657714285714286 0.0 0.17599999804632568)
            (0.677142857142857 0.0020000000949949026 0.17599999804632568)
            (0.677142857142857 0.0 0.17599999804632568)
            (0.696571428571429 0.0020000000949949026 0.17599999804632568)
            (0.696571428571429 0.0 0.17599999804632568)
            (0.716 0.0020000000949949026 0.17599999804632568)
            (0.716 0.0 0.17599999804632568)
            (0.716 0.0020000000949949026 0.146666666666667)
            (0.716 0.0 0.146666666666667)
            (0.716 0.0020000000949949026 0.117333333333333)
            (0.716 0.0 0.117333333333333)
            (0.716 0.0020000000949949026 0.088)
            (0.716 0.0 0.088)
            (0.716 0.0020000000949949026 0.058666666666667)
            (0.716 0.0 0.058666666666667)
            (0.716 0.0020000000949949026 0.029333333333333)
            (0.716 0.0 0.029333333333333)
            (0.716 0.0020000000949949026 0.0)
            (0.716 0.0 0.0)
            (0.685142857142857 0.0020000000949949026 0.0)
            (0.685142857142857 0.0 0.0)
            (0.654285714285714 0.0020000000949949026 0.0)
            (0.654285714285714 0.0 0.0)
            (0.623428571428571 0.0020000000949949026 0.0)
            (0.623428571428571 0.0 0.0)
            (0.592571428571429 0.0020000000949949026 0.0)
            (0.592571428571429 0.0 0.0)
            (0.561714285714286 0.0020000000949949026 0.0)
            (0.561714285714286 0.0 0.0)
            (0.530857142857143 0.0020000000949949026 0.0)
            (0.530857142857143 0.0 0.0)
            (0.5 0.0020000000949949026 0.0)
            (0.5 0.0 0.0)
            (0.513333333333333 0.0020000000949949026 0.029333333333333)
            (0.513333333333333 0.0 0.029333333333333)
            (0.526666666666667 0.0020000000949949026 0.058666666666667)
            (0.526666666666667 0.0 0.058666666666667)
            (0.54 0.0020000000949949026 0.088)
            (0.54 0.0 0.088)
            (0.553333333333333 0.0020000000949949026 0.117333333333333)
            (0.553333333333333 0.0 0.117333333333333)
            (0.566666666666667 0.0020000000949949026 0.146666666666667)
            (0.566666666666667 0.0 0.146666666666667)
            (0.588 0.0020000000949949026 0.146666666666667)
            (0.588 0.0 0.146666666666667)
            (0.609333333333333 0.0020000000949949026 0.146666666666667)
            (0.609333333333333 0.0 0.146666666666667)
            (0.630666666666667 0.0020000000949949026 0.146666666666667)
            (0.630666666666667 0.0 0.146666666666667)
            (0.652 0.0020000000949949026 0.146666666666667)
            (0.652 0.0 0.146666666666667)
            (0.673333333333333 0.0020000000949949026 0.146666666666667)
            (0.673333333333333 0.0 0.146666666666667)
            (0.694666666666667 0.0020000000949949026 0.146666666666667)
            (0.694666666666667 0.0 0.146666666666667)
            (0.576571428571429 0.0020000000949949026 0.117333333333333)
            (0.576571428571429 0.0 0.117333333333333)
            (0.599809523809524 0.0020000000949949026 0.117333333333333)
            (0.599809523809524 0.0 0.117333333333333)
            (0.623047619047619 0.0020000000949949026 0.117333333333333)
            (0.623047619047619 0.0 0.117333333333333)
            (0.646285714285714 0.0020000000949949026 0.117333333333333)
            (0.646285714285714 0.0 0.117333333333333)
            (0.66952380952381 0.0020000000949949026 0.117333333333333)
            (0.66952380952381 0.0 0.117333333333333)
            (0.692761904761905 0.0020000000949949026 0.117333333333333)
            (0.692761904761905 0.0 0.117333333333333)
            (0.565142857142857 0.0020000000949949026 0.088)
            (0.565142857142857 0.0 0.088)
            (0.590285714285714 0.0020000000949949026 0.088)
            (0.590285714285714 0.0 0.088)
            (0.615428571428571 0.0020000000949949026 0.088)
            (0.615428571428571 0.0 0.088)
            (0.640571428571429 0.0020000000949949026 0.088)
            (0.640571428571429 0.0 0.088)
            (0.665714285714286 0.0020000000949949026 0.088)
            (0.665714285714286 0.0 0.088)
            (0.690857142857143 0.0020000000949949026 0.088)
            (0.690857142857143 0.0 0.088)
            (0.553714285714286 0.0020000000949949026 0.058666666666667)
            (0.553714285714286 0.0 0.058666666666667)
            (0.580761904761905 0.0020000000949949026 0.058666666666667)
            (0.580761904761905 0.0 0.058666666666667)
            (0.607809523809524 0.0020000000949949026 0.058666666666667)
            (0.607809523809524 0.0 0.058666666666667)
            (0.634857142857143 0.0020000000949949026 0.058666666666667)
            (0.634857142857143 0.0 0.058666666666667)
            (0.661904761904762 0.0020000000949949026 0.058666666666667)
            (0.661904761904762 0.0 0.058666666666667)
            (0.688952380952381 0.0020000000949949026 0.058666666666667)
            (0.688952380952381 0.0 0.058666666666667)
            (0.542285714285714 0.0020000000949949026 0.029333333333333)
            (0.542285714285714 0.0 0.029333333333333)
            (0.571238095238095 0.0020000000949949026 0.029333333333333)
            (0.571238095238095 0.0 0.029333333333333)
            (0.600190476190476 0.0020000000949949026 0.029333333333333)
            (0.600190476190476 0.0 0.029333333333333)
            (0.629142857142857 0.0020000000949949026 0.029333333333333)
            (0.629142857142857 0.0 0.029333333333333)
            (0.658095238095238 0.0020000000949949026 0.029333333333333)
            (0.658095238095238 0.0 0.029333333333333)
            (0.687047619047619 0.0020000000949949026 0.029333333333333)
            (0.687047619047619 0.0 0.029333333333333)
        );

        fields
        (
            p
            rho
            T
            U
        );

    }  
};