openfoam_cases/[3]-80-pcnt-test-fin/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 -0.5 0)
    (5 -0.5 0)
    (5 0.5 0)
    (0 0.5 0)
    (0 -0.5 1)
    (5 -0.5 1)
    (5 0.5 1)
    (0 0.5 1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 10 10) simpleGrading (1 1 1)
);

boundary
(
    farField
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
            (4 5 6 7)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }
    floor
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
);

// ************************************************************************* //