openfoam_cases/[3]-80-pcnt-test-fin/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    farField
    {
        type            patch;
        nFaces          1500;
        startFace       43784;
    }
    inlet
    {
        type            patch;
        nFaces          100;
        startFace       45284;
    }
    outlet
    {
        type            patch;
        nFaces          100;
        startFace       45384;
    }
    floor
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1001;
        startFace       45484;
    }
    fin
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1606;
        startFace       46485;
    }
)

// ************************************************************************* //
