openfoam_cases/[3]-80-pcnt-test-fin/constant/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        nMoles          1;
        molWeight       28.97;  // Air molecular weight, adjust for your gas
    }
    thermodynamics
    {
        Cp              1005;   // J/kg-K
        Hf              0;
    }
    transport
    {
        mu              1.8e-5; // dynamic viscosity in Pa.s
        Pr              0.7;    // Prandtl number
    }
}
