openfoam_cases/[3]-80-pcnt-test-fin/0/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

flowVelocity (400 0 0);
pressure 101325;
temperature 300;
turbulentKE 0.24;
turbulentOmega 4.140866625;