openfoam_cases/[3]-80-pcnt-test-fin/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     11;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type calculated;
        value uniform 0;
    }

    outlet
    {
        type zeroGradient;
        value uniform 0;
    }

    fin
    {
        type nutkWallFunction;
        value uniform 0;
    }

    wall
    {
        type nutkWallFunction;
        value uniform 0;
    }

    farField
    {
        type calculated;
        value uniform 0;
    }
}
