openfoam_cases/[3]-80-pcnt-test-fin/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     11;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * *

#include        "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform $turbulentOmega;
    }

    outlet
    {
        type zeroGradient;
    }

    fin
    {
        type omegaWallFunction;
        value uniform 0;
    }

    wall
    {
        type omegaWallFunction;
        value uniform 0;
    }

    farField
    {
        type fixedValue;
        value uniform $turbulentOmega;
    }
}
