openfoam_cases/[3]-80-pcnt-test-fin/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}

ddtSchemes
{
    default         localEuler;       // implicit time discretization
}

gradSchemes
{
    default         cellLimited Gauss linear 1;
    grad(p)         cellLimited Gauss linear 0.333;
}

divSchemes
{
    default         none;

    div(phi,U)      Gauss vanLeerV;

    div(phi,e)      Gauss limitedLinear 1;
    div(phi,K)      Gauss linear;

    turbulence      Gauss upwind;
    div(phi,k)      $turbulence;
    div(phi,omega)  $turbulence;

    div(phiv,p)     Gauss upwind;
    div(phid,p)     Gauss limitedLinear 1;

    div(((rho*nuEff)*dev2(T(grad(U)))))    Gauss linear;

    div(phi,(p|rho)) Gauss upwind;
}

laplacianSchemes
{
    default         Gauss linear limited 1;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         limited 1;
}

wallDist
{
    method meshWave;
}
