openfoam_cases/[3]-80-pcnt-test-fin/system/surfaceFeaturesDict
FoamFile
{
    version     11;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}

includedAngle 150;

surfaces
(
    "fin.stl"
);
